## 2D PANDAS DATAFRAMES
- 2D dataframes = means more than 1 columns

In [192]:
import  numpy as np
import pandas as pd

### **1.1 Creation**
1. list of lists - nested list
2. 2D array
3. dictionary
4. transpose
5. missing value

In [193]:
# from list of lists ----- items will store in rows
l=[[10,20,30],[40,50,60]]
df=pd.DataFrame(l, index=['a','b'], columns=['x','y','z'])
print(df)

    x   y   z
a  10  20  30
b  40  50  60

In [194]:
# from 2D array
a=np.array([[1,2,3],[4,5,6]])
df=pd.DataFrame(a, columns=['c1','c2','c3'] , index=['r1','r2'])
print(df)

    c1  c2  c3
r1   1   2   3
r2   4   5   6

In [195]:
# using Dictionary ----- items will store as column
d={'x':[1,2,3],'y':[4,5,6],'z':[7,8,9]}
df=pd.DataFrame(d, index=['a','b','c'])
print(df)

   x  y  z
a  1  4  7
b  2  5  8
c  3  6  9

In [196]:
# transpose ----- rows to columns or columns to rows
l=[[10,20,30],[40,50,60]]
df=pd.DataFrame(l)
df.T

    0   1
0  10  40
1  20  50
2  30  60

In [197]:
# missing value ----- np.nan 

l=[[1,np.nan,2],[4,5,6],[7,'sam',9]]
df=pd.DataFrame(l)
print(df)

x=df.isnull()
print(x)

   0    1  2
0  1  NaN  2
1  4    5  6
2  7  sam  9
       0      1      2
0  False   True  False
1  False  False  False
2  False  False  False

### **1.2 Extraction**
1. Single & Multiple value
2. Single row
3. Single column
4. Multiple row
    1. pattern
    2. no pattern
5. Multiple column
    1. pattern
    2. no pattern
6. Reverse printing row/column
7. Multiple row and multiple column
8. Based upon condition
    1. single
    2. multiple

- **iloc gives index no.**
- **loc gives index name**
- **SYNTAX - df.iloc/loc[ row, column ]**
- **df["col_name"] --> gives whole column**
- **df[["list_of_col_name"]] --> list of columns**
- **df.loc[index_name] --> fives whole row**

In [198]:
import pandas as pd
df=pd.DataFrame([[10,20,30],[40,50,60],[70,80,90]], index=['r1','r2','r3'] , columns=['c1','c2','c3'])
print(df)

    c1  c2  c3
r1  10  20  30
r2  40  50  60
r3  70  80  90

In [199]:
# 1.single value
print(df.iloc[0,2])
print(df.loc['r1','c3'],'\n')

# multiple value
print(df.iloc[[0,2],0])
print(df.loc[['r1','r3'],'c1'])

30
30

r1    10
r3    70
Name: c1, dtype: int64
r1    10
r3    70
Name: c1, dtype: int64

In [200]:
# 2.single row
# 2.1
print(df.iloc[1,:])
# 2.2 
print(df.loc['r2'],'\n')    # '\n' is for breaking line


# 3.single column
# 3.1
print(df.iloc[:,2])
# 3.2
print(df['c2']) # always write column name as it is dataframe == columns

c1    40
c2    50
c3    60
Name: r2, dtype: int64
c1    40
c2    50
c3    60
Name: r2, dtype: int64

r1    30
r2    60
r3    90
Name: c3, dtype: int64
r1    20
r2    50
r3    80
Name: c2, dtype: int64

In [201]:
# slicing

# 4.1 multiple row
print(df.iloc[0:2,:]) # here 0 is included and 2 is not thats why it returns r1 and r2
print(df.loc['r1':'r2',:])

# 5.1 multiple column
print(df.iloc[:,0:1])
print(df.loc[:,'c1':'c2'])

    c1  c2  c3
r1  10  20  30
r2  40  50  60
    c1  c2  c3
r1  10  20  30
r2  40  50  60
    c1
r1  10
r2  40
r3  70
    c1  c2
r1  10  20
r2  40  50
r3  70  80

In [202]:
# indexing

# 4.2 multiple row
print(df.iloc[[1,2], : ])
print(df.loc[['r2','r3'],:])
print(df.loc[['r2','r3']],'\n')

# 5.2 multiple column
print(df.iloc[:,[1,2]])
print(df.loc[:,['c2','c3']])
print(df[['c2','c3']])

    c1  c2  c3
r2  40  50  60
r3  70  80  90
    c1  c2  c3
r2  40  50  60
r3  70  80  90
    c1  c2  c3
r2  40  50  60
r3  70  80  90

    c2  c3
r1  20  30
r2  50  60
r3  80  90
    c2  c3
r1  20  30
r2  50  60
r3  80  90
    c2  c3
r1  20  30
r2  50  60
r3  80  90

In [203]:
# 6.1 reverse printing row
print(df.iloc[::-1,1])

# 6.2 reverse printing column
print(df.iloc[0,::-1])

r3    80
r2    50
r1    20
Name: c2, dtype: int64
c3    30
c2    20
c1    10
Name: r1, dtype: int64

In [204]:
# 7.multiple row and multiple column

print(df.iloc[[1,2],[0,1]])
print(df.loc[['r2','r3'],['c1','c2']])

    c1  c2
r2  40  50
r3  70  80
    c1  c2
r2  40  50
r3  70  80

In [205]:
# 8.based upon condition

# 8.1 single condition
print(df['c1']>20)  # return bool value for every value
print(df[df['c1']>20]) # The filtering (df[...]) is row-based, c2 and c3 values appear because the whole row is being returned, there is no conncetion of them with condition.
print(df[df['c1']>20]['c1'])
print(df['c1'][df['c1']>20])

r1    False
r2     True
r3     True
Name: c1, dtype: bool
    c1  c2  c3
r2  40  50  60
r3  70  80  90
r2    40
r3    70
Name: c1, dtype: int64
r2    40
r3    70
Name: c1, dtype: int64

In [206]:
# 8.2 multiple condition
    # done by using logical operators &(and), |(or), ~(not)

print(df[(df['c1']==70) & (df['c3']>40)])   # select the entire record where condition satisfies
print(~(df['c2']==70))

    c1  c2  c3
r3  70  80  90
r1    True
r2    True
r3    True
Name: c2, dtype: bool

### **1.3 Modification**
1. set index
2. reset index
3. replace with
    1. single value
    2. multiple value
    3. middle value
    4. multiple row with multiple value
    5. multiple column with multiple value
4. delete/drop
    1. single row
    2. multiple row
    3. single column
    4. multiple column
5. add
    1. single row
    2. single column
    3. new column based on existing ones
    4. using arange()
6. sort values

In [207]:
df1= pd.DataFrame({
    'Age': [22, 30, 23, 25, 24],
    'Salary': [28000, 17000, 46000, 42000, 55000],
    'Gender': ["M", "F", "M", "M", "F"]
})
df1

   Age  Salary Gender
0   22   28000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [208]:
# 1. set index

data=df1.set_index('Age')
data

     Salary Gender
Age
22    28000      M
30    17000      F
23    46000      M
25    42000      M
24    55000      F

In [209]:
# 2.reset index

data.reset_index()

   Age  Salary Gender
0   22   28000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [210]:
# 3.1 replace with single value
x=df1.copy()
x['Age']=20
x

   Age  Salary Gender
0   20   28000      M
1   20   17000      F
2   20   46000      M
3   20   42000      M
4   20   55000      F

In [211]:
# 3.2 replace with multiple value
y=df1.copy()
y['Age']=[10,20,30,40,50]
y

   Age  Salary Gender
0   10   28000      M
1   20   17000      F
2   30   46000      M
3   40   42000      M
4   50   55000      F

In [212]:
# 3.3 replace middle value
z=df1.copy()
z.iloc[1,1]=0
z

   Age  Salary Gender
0   22   28000      M
1   30       0      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [213]:
# 3.4 multiple row with multiple value
p=df1.copy()
p.iloc[[1,2]]=[[0,0,0],[1,1,1]]
p

   Age  Salary Gender
0   22   28000      M
1    0       0      0
2    1       1      1
3   25   42000      M
4   24   55000      F

In [214]:
# 3.5 multiple column with multiple value
q=df1.copy()
q[['Age','Gender']]=[0,0],[0,0],[0,0],[0,0],[0,0]   # Matches 5 rows, 2 columns shape.
q

   Age  Salary  Gender
0    0   28000       0
1    0   17000       0
2    0   46000       0
3    0   42000       0
4    0   55000       0

In [215]:
# 4.1 drop single row
a=df.copy()
print(a.drop(index='r1'),'\n') 
print(a.drop('r3',axis=0))  # axis, 0=row 1=column

    c1  c2  c3
r2  40  50  60
r3  70  80  90

    c1  c2  c3
r1  10  20  30
r2  40  50  60

In [225]:
# 4.2 drop multiple row
b=df.copy()
print(b.drop(index=['r1','r3']),'\n')
print(b.drop(['r1','r2'],axis=0))

    c1  c2  c3
r2  40  50  60

    c1  c2  c3
r3  70  80  90

In [220]:
# 4.3 drop single column
c=df.copy()
print(c.drop(columns='c2'),'\n')
print(df.drop('c3',axis=1,inplace=False))   # here inplace ture mean change in original dataframe

    c1  c3
r1  10  30
r2  40  60
r3  70  90

    c1  c2
r1  10  20
r2  40  50
r3  70  80

In [227]:
# 4.4 drop multiple column 
d=df.copy()
print(d.drop(columns=['c1','c2']),'\n')
print(d.drop(['c2','c3'],axis=1))

    c3
r1  30
r2  60
r3  90

    c1
r1  10
r2  40
r3  70

In [238]:
# 5.1 add single row
j=df.copy()
j.loc['r4'] = [100, 110, 120]
j

     c1   c2   c3
r1   10   20   30
r2   40   50   60
r3   70   80   90
r4  100  110  120

In [239]:
# 5.2 add single column
i=df.copy()
i['c4']=[100,200,300]
i

    c1  c2  c3   c4
r1  10  20  30  100
r2  40  50  60  200
r3  70  80  90  300